ChargePoint/emb-uboot-imx/board/freescale/imx8qxp_ucb/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v6.0
processor: MIMX8QX6xxxFZ
package_id: MIMX8QX6AVLFZ
mcu_data: ksdk2_0
processor_version: 6.0.0
pin_labels:
- {pin_num: U35, pin_signal: ADC_IN0, label: BLU_DET_ADC}
- {pin_num: G31, pin_signal: SPDIF0_RX, label: ENET1_RGMII_RXD0}
- {pin_num: D34, pin_signal: SPDIF0_TX, label: ENET1_RGMII_RX_CTL}
- {pin_num: H24, pin_signal: ENET0_RGMII_TXC, label: ENET0_RGMII_TXC}
- {pin_num: G25, pin_signal: ENET0_RGMII_TXD0, label: ENET0_RGMII_TXD0}
- {pin_num: B28, pin_signal: ENET0_RGMII_TXD1, label: ENET0_RGMII_TXD1}
- {pin_num: E27, pin_signal: ENET0_RGMII_TXD2, label: ENET0_RGMII_TXD2}
- {pin_num: F26, pin_signal: ENET0_RGMII_TXD3, label: ENET0_RGMII_TXD3}
- {pin_num: A29, pin_signal: ENET0_RGMII_TX_CTL, label: ENET0_RGMII_TX_CTL}
- {pin_num: B30, pin_signal: ENET0_RGMII_RX_CTL, label: ENET0_RGMII_RX_CTL}
- {pin_num: H26, pin_signal: ENET0_RGMII_RXD3, label: ENET0_RGMII_RXD3}
- {pin_num: A31, pin_signal: ENET0_RGMII_RXD0, label: ENET0_RGMII_RXD0}
- {pin_num: C29, pin_signal: ENET0_RGMII_RXD1, label: ENET0_RGMII_RXD1}
- {pin_num: G27, pin_signal: ENET0_RGMII_RXD2, label: ENET0_RGMII_RXD2}
- {pin_num: D28, pin_signal: ENET0_RGMII_RXC, label: ENET0_RGMII_RXC}
- {pin_num: B32, pin_signal: ENET0_MDIO, label: ENET0_MDIO}
- {pin_num: D30, pin_signal: ENET0_MDC, label: ENET0_MDC}
- {pin_num: AP28, pin_signal: CSI_EN, label: UX_5V_OC}
- {pin_num: AM26, pin_signal: CSI_MCLK, label: UX_PWR_EN}
- {pin_num: AK26, pin_signal: CSI_PCLK, label: UX_GSTIC_TS}
- {pin_num: AR27, pin_signal: CSI_RESET, label: UX_GSTIC_RSTn}
- {pin_num: U29, pin_signal: ADC_VREFH, label: 1V8}
- {pin_num: U31, pin_signal: ADC_VREFL, label: 0V}
- {pin_num: AK34, pin_signal: ANA_TEST_OUT_N, label: ANA_TESTN_TP50}
- {pin_num: AL35, pin_signal: ANA_TEST_OUT_P, label: ANA_TESTP_TP49}
- {pin_num: F30, pin_signal: ESAI0_FSR, label: ENET1_RGMII_TXC}
- {pin_num: G29, pin_signal: ESAI0_FST, label: ENET1_RGMII_TXD2}
- {pin_num: H28, pin_signal: ESAI0_SCKR, label: ENET1_RGMII_TX_CTL}
- {pin_num: E31, pin_signal: ESAI0_SCKT, label: ENET1_RGMII_TXD3}
- {pin_num: G35, pin_signal: MCLK_IN0, label: RFID_PWR_EN}
- {pin_num: M28, pin_signal: MCLK_IN1, label: I2C3_SDA}
- {pin_num: K30, pin_signal: SPI3_CS1, label: I2C3_SCL}
- {pin_num: G19, pin_signal: EMMC0_CLK, label: EMMC_CLK}
- {pin_num: F22, pin_signal: EMMC0_STROBE, label: EMMC_STROBE}
- {pin_num: C21, pin_signal: EMMC0_DATA0, label: EMMC_DATA0}
- {pin_num: A21, pin_signal: EMMC0_DATA1, label: EMMC_DATA1}
- {pin_num: E21, pin_signal: EMMC0_DATA2, label: EMMC_DATA2}
- {pin_num: H20, pin_signal: EMMC0_DATA3, label: EMMC_DATA3}
- {pin_num: B22, pin_signal: EMMC0_DATA4, label: EMMC_DATA4}
- {pin_num: G21, pin_signal: EMMC0_DATA5, label: EMMC_DATA5}
- {pin_num: A23, pin_signal: EMMC0_DATA6, label: EMMC_DATA6}
- {pin_num: D22, pin_signal: EMMC0_DATA7, label: EMMC_DATA7}
- {pin_num: D20, pin_signal: EMMC0_CMD, label: EMMC_CMD}
- {pin_num: AD30, pin_signal: MIPI_DSI1_GPIO0_00, label: I2C2_SCL}
- {pin_num: AF34, pin_signal: MIPI_DSI1_GPIO0_01, label: I2C2_SDA}
power_domains: {VDD_DDR_VDDQ: '1.1', VDD_PCIE_LDO_1P0_CAP: '1.0', VDD_PCIE_DIG_1P8_3P3: '3.3', VDD_USB_SS3_LDO_1P0_CAP: '1.0', VDD_EMMC0_1P8_3P3: '1.8', VDD_EMMC0_VSELECT_1P8_3P3: '1.8',
  VDD_USDHC1_VSELECT_1P8_3P3: '1.8', VDD_USDHC1_1P8_3P3: '1.8', VDD_ENET0_VSELECT_1P8_2P5_3P3: '2.5', VDD_ENET0_1P8_2P5_3P3: '2.5', VDD_ENET_MDIO_1P8_3P3: '2.5',
  VDD_ESAI_SPDIF_1P8_2P5_3P3: '2.5', VDD_USB_3P3: '3.3', VDD_PCIE_1P8: '1.8', VDD_USB_1P8: '1.8', VDD_SPI_MCLK_UART_1P8_3P3: '3.3', VDD_PCIE0_1P0: '1.8', VDD_SPI_SAI_1P8_3P3: '3.3',
  VDD_USB_OTG_1P0: '1.0', VDD_ANA0_1P8: '1.8', VDD_GPU: '1.1', VDD_ADC_1P8: '1.8', VDD_ADC_DIG_1P8: '1.8', VDD_CAN_UART_1P8_3P3: '3.3', VDD_A53: '1.1', VDD_MIPI_DSI_DIG_1P8_3P3: '3.3',
  VDD_ANA1_1P8: '1.8', VDD_DDR_PLL_1P8: '1.8', VDD_SNVS_4P2: '3.0', VDD_TMPR_CSI_1P8_3P3: '3.3', VDD_QSPI0B_1P8_3P3: '3.3', VDD_QSPI0A_1P8_3P3: '1.8', VDD_MIPI_CSI_DIG_1P8: '1.8',
  VDD_CSI_1P8_3P3: '3.3', VDD_SNVS_LDO_1P8_CAP: '1.8', VDD_MIPI_DSI0_1P8: '1.8', VDD_SCU_ANA_1P8: '1.8', VDD_MIPI_DSI1_1P8: '1.8', VDD_MIPI_CSI0_1P8: '1.8'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include <common.h>
#include <asm/arch/imx8-pins.h>
#include <asm/arch/sci/sci.h>
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
/*
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}
*/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: a35_0}
- pin_list:
  - {pin_num: Y32, peripheral: ADMA__FLEXCAN0, signal: flexcan_tx, pin_signal: FLEXCAN0_TX}
  - {pin_num: Y34, peripheral: ADMA__FLEXCAN0, signal: flexcan_rx, pin_signal: FLEXCAN0_RX}
  - {pin_num: AA33, peripheral: ADMA__FLEXCAN1, signal: flexcan_rx, pin_signal: FLEXCAN1_RX}
  - {pin_num: AA35, peripheral: ADMA__FLEXCAN1, signal: flexcan_tx, pin_signal: FLEXCAN1_TX}
  - {pin_num: AB32, peripheral: ADMA__UART0, signal: uart_rx, pin_signal: UART0_RX}
  - {pin_num: AA29, peripheral: ADMA__UART0, signal: uart_tx, pin_signal: UART0_TX}
  - {pin_num: L31, peripheral: ADMA__UART1, signal: uart_rx, pin_signal: UART1_RX}
  - {pin_num: H34, peripheral: ADMA__UART1, signal: uart_tx, pin_signal: UART1_TX}
  - {pin_num: AA31, peripheral: ADMA__UART3, signal: uart_tx, pin_signal: FLEXCAN2_TX}
  - {pin_num: B18, peripheral: CONN__USB_SS3, signal: 'usb_ss_rx_m_ln, 0', pin_signal: USB_SS3_RX_N}
  - {pin_num: A19, peripheral: CONN__USB_SS3, signal: 'usb_ss_rx_p_ln, 0', pin_signal: USB_SS3_RX_P}
  - {pin_num: A15, peripheral: CONN__USB_SS3, signal: 'usb_ss_tx_m_ln, 0', pin_signal: USB_SS3_TX_N}
  - {pin_num: B16, peripheral: CONN__USB_SS3, signal: 'usb_ss_tx_p_ln, 0', pin_signal: USB_SS3_TX_P}
  - {pin_num: E13, peripheral: CONN__USB_SS3, signal: usb_ss_rext, pin_signal: USB_SS3_REXT}
  - {pin_num: E17, peripheral: CONN__USB_OTG2, signal: usb_otg_dp, pin_signal: USB_OTG2_DP}
  - {pin_num: D16, peripheral: CONN__USB_OTG2, signal: usb_otg_dm, pin_signal: USB_OTG2_DN}
  - {pin_num: D18, peripheral: CONN__USB_OTG1, signal: usb_otg_dp, pin_signal: USB_OTG1_DP}
  - {pin_num: E19, peripheral: CONN__USB_OTG1, signal: usb_otg_dn, pin_signal: USB_OTG1_DN}
  - {pin_num: G17, peripheral: CONN__USB_OTG1, signal: usb_otg_id, pin_signal: USB_OTG1_ID}
  - {pin_num: F16, peripheral: CONN__USB_OTG2, signal: usb_otg_id, pin_signal: USB_OTG2_ID}
  - {pin_num: D14, peripheral: CONN__USB_OTG2, signal: usb_otg_rtrim, pin_signal: USB_OTG2_REXT}
  - {pin_num: H16, peripheral: CONN__USB_OTG2, signal: usb_otg_vbus, pin_signal: USB_OTG2_VBUS}
  - {pin_num: H18, peripheral: CONN__USB_OTG1, signal: usb_otg_vbus, pin_signal: USB_OTG1_VBUS}
  - {pin_num: H24, peripheral: CONN__ENET0, signal: enet_rgmii_txc, pin_signal: ENET0_RGMII_TXC}
  - {pin_num: A29, peripheral: CONN__ENET0, signal: enet_rgmii_tx_ctl, pin_signal: ENET0_RGMII_TX_CTL}
  - {pin_num: G25, peripheral: CONN__ENET0, signal: 'enet_rgmii_txd, 0', pin_signal: ENET0_RGMII_TXD0}
  - {pin_num: B28, peripheral: CONN__ENET0, signal: 'enet_rgmii_txd, 1', pin_signal: ENET0_RGMII_TXD1}
  - {pin_num: E27, peripheral: CONN__ENET0, signal: 'enet_rgmii_txd, 2', pin_signal: ENET0_RGMII_TXD2}
  - {pin_num: F26, peripheral: CONN__ENET0, signal: 'enet_rgmii_txd, 3', pin_signal: ENET0_RGMII_TXD3}
  - {pin_num: D28, peripheral: CONN__ENET0, signal: enet_rgmii_rxc, pin_signal: ENET0_RGMII_RXC}
  - {pin_num: B30, peripheral: CONN__ENET0, signal: enet_rgmii_rx_ctl, pin_signal: ENET0_RGMII_RX_CTL}
  - {pin_num: A31, peripheral: CONN__ENET0, signal: 'enet_rgmii_rxd, 0', pin_signal: ENET0_RGMII_RXD0}
  - {pin_num: C29, peripheral: CONN__ENET0, signal: 'enet_rgmii_rxd, 1', pin_signal: ENET0_RGMII_RXD1}
  - {pin_num: G27, peripheral: CONN__ENET0, signal: 'enet_rgmii_rxd, 2', pin_signal: ENET0_RGMII_RXD2}
  - {pin_num: H26, peripheral: CONN__ENET0, signal: 'enet_rgmii_rxd, 3', pin_signal: ENET0_RGMII_RXD3}
  - {pin_num: B32, peripheral: CONN__ENET0, signal: enet_mdio, pin_signal: ENET0_MDIO}
  - {pin_num: D30, peripheral: CONN__ENET0, signal: enet_mdc, pin_signal: ENET0_MDC}
  - {pin_num: D32, peripheral: CONN__ENET1, signal: enet_rgmii_rxc, pin_signal: ESAI0_TX0}
  - {pin_num: G31, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 0', pin_signal: SPDIF0_RX}
  - {pin_num: C33, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 1', pin_signal: ESAI0_TX3_RX2}
  - {pin_num: B34, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 3', pin_signal: ESAI0_TX1}
  - {pin_num: D34, peripheral: CONN__ENET1, signal: enet_rgmii_rx_ctl, pin_signal: SPDIF0_TX}
  - {pin_num: F32, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 0', pin_signal: ESAI0_TX4_RX1}
  - {pin_num: J29, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 1', pin_signal: ESAI0_TX5_RX0}
  - {pin_num: G29, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 2', pin_signal: ESAI0_FST}
  - {pin_num: E31, peripheral: CONN__ENET1, signal: 'enet_rgmii_txd, 3', pin_signal: ESAI0_SCKT}
  - {pin_num: H28, peripheral: CONN__ENET1, signal: enet_rgmii_tx_ctl, pin_signal: ESAI0_SCKR}
  - {pin_num: F30, peripheral: CONN__ENET1, signal: enet_rgmii_txc, pin_signal: ESAI0_FSR}
  - {pin_num: K28, peripheral: CONN__ENET1, signal: 'enet_rgmii_rxd, 2', pin_signal: ESAI0_TX2_RX3}
  - {pin_num: B10, peripheral: HSIO__PCIE0, signal: pcie_tx0_p, pin_signal: PCIE0_TX0_P}
  - {pin_num: A9, peripheral: HSIO__PCIE0, signal: pcie_tx0_n, pin_signal: PCIE0_TX0_N}
  - {pin_num: A13, peripheral: HSIO__PCIE0, signal: pcie_rx0_p, pin_signal: PCIE0_RX0_P}
  - {pin_num: B12, peripheral: HSIO__PCIE0, signal: pcie_rx0_n, pin_signal: PCIE0_RX0_N}
  - {pin_num: G11, peripheral: HSIO__PCIE0, signal: pcie_pll_ref_return, pin_signal: PCIE0_PHY_PLL_REF_RETURN}
  - {pin_num: H12, peripheral: HSIO__PCIE, signal: pcie_rext, pin_signal: PCIE_REXT}
  - {pin_num: D10, peripheral: HSIO__PCIE0, signal: pcie_clkreq_b, pin_signal: PCIE_CTRL0_CLKREQ_B}
  - {pin_num: H10, peripheral: HSIO__PCIE0, signal: pcie_perst_b, pin_signal: PCIE_CTRL0_PERST_B}
  - {pin_num: A11, peripheral: HSIO__PCIE0, signal: pcie_wake_b, pin_signal: PCIE_CTRL0_WAKE_B}
  - {pin_num: E11, peripheral: HSIO__PCIE_IOB, signal: pcie_iob_ext_refclk100m_p, pin_signal: PCIE_REFCLK100M_P}
  - {pin_num: D12, peripheral: HSIO__PCIE_IOB, signal: pcie_iob_ext_refclk100m_n, pin_signal: PCIE_REFCLK100M_N}
  - {pin_num: G19, peripheral: CONN__EMMC0, signal: emmc_clk, pin_signal: EMMC0_CLK}
  - {pin_num: D20, peripheral: CONN__EMMC0, signal: emmc_cmd, pin_signal: EMMC0_CMD}
  - {pin_num: C21, peripheral: CONN__EMMC0, signal: 'emmc_data, 0', pin_signal: EMMC0_DATA0}
  - {pin_num: A21, peripheral: CONN__EMMC0, signal: 'emmc_data, 1', pin_signal: EMMC0_DATA1}
  - {pin_num: E21, peripheral: CONN__EMMC0, signal: 'emmc_data, 2', pin_signal: EMMC0_DATA2}
  - {pin_num: H20, peripheral: CONN__EMMC0, signal: 'emmc_data, 3', pin_signal: EMMC0_DATA3}
  - {pin_num: B22, peripheral: CONN__EMMC0, signal: 'emmc_data, 4', pin_signal: EMMC0_DATA4}
  - {pin_num: G21, peripheral: CONN__EMMC0, signal: 'emmc_data, 5', pin_signal: EMMC0_DATA5}
  - {pin_num: A23, peripheral: CONN__EMMC0, signal: 'emmc_data, 6', pin_signal: EMMC0_DATA6}
  - {pin_num: D22, peripheral: CONN__EMMC0, signal: 'emmc_data, 7', pin_signal: EMMC0_DATA7}
  - {pin_num: F22, peripheral: CONN__EMMC0, signal: emmc_strobe, pin_signal: EMMC0_STROBE}
  - {pin_num: AB8, peripheral: DRC, signal: drc_ato, pin_signal: DDR_ATO}
  - {pin_num: Y6, peripheral: DRC, signal: drc_ck0_n, pin_signal: DDR_CK0_N}
  - {pin_num: W5, peripheral: DRC, signal: drc_ck0_p, pin_signal: DDR_CK0_P}
  - {pin_num: N5, peripheral: DRC, signal: drc_ck1_n, pin_signal: DDR_CK1_N}
  - {pin_num: P6, peripheral: DRC, signal: drc_ck1_p, pin_signal: DDR_CK1_P}
  - {pin_num: W1, peripheral: DRC, signal: 'drc_dcf, 00', pin_signal: DDR_DCF00}
  - {pin_num: U3, peripheral: DRC, signal: 'drc_dcf, 01', pin_signal: DDR_DCF01}
  - {pin_num: U1, peripheral: DRC, signal: 'drc_dcf, 03', pin_signal: DDR_DCF03}
  - {pin_num: U7, peripheral: DRC, signal: 'drc_dcf, 04', pin_signal: DDR_DCF04}
  - {pin_num: U5, peripheral: DRC, signal: 'drc_dcf, 05', pin_signal: DDR_DCF05}
  - {pin_num: T2, peripheral: DRC, signal: 'drc_dcf, 07', pin_signal: DDR_DCF07}
  - {pin_num: AB4, peripheral: DRC, signal: 'drc_dcf, 08', pin_signal: DDR_DCF08}
  - {pin_num: AB6, peripheral: DRC, signal: 'drc_dcf, 09', pin_signal: DDR_DCF09}
  - {pin_num: AC5, peripheral: DRC, signal: 'drc_dcf, 10', pin_signal: DDR_DCF10}
  - {pin_num: W3, peripheral: DRC, signal: 'drc_dcf, 11', pin_signal: DDR_DCF11}
  - {pin_num: Y8, peripheral: DRC, signal: 'drc_dcf, 12', pin_signal: DDR_DCF12}
  - {pin_num: Y2, peripheral: DRC, signal: 'drc_dcf, 14', pin_signal: DDR_DCF14}
  - {pin_num: Y4, peripheral: DRC, signal: 'drc_dcf, 15', pin_signal: DDR_DCF15}
  - {pin_num: W7, peripheral: DRC, signal: 'drc_dcf, 16', pin_signal: DDR_DCF16}
  - {pin_num: N3, peripheral: DRC, signal: 'drc_dcf, 17', pin_signal: DDR_DCF17}
  - {pin_num: L1, peripheral: DRC, signal: 'drc_dcf, 18', pin_signal: DDR_DCF18}
  - {pin_num: N1, peripheral: DRC, signal: 'drc_dcf, 19', pin_signal: DDR_DCF19}
  - {pin_num: P4, peripheral: DRC, signal: 'drc_dcf, 20', pin_signal: DDR_DCF20}
  - {pin_num: T8, peripheral: DRC, signal: 'drc_dcf, 21', pin_signal: DDR_DCF21}
  - {pin_num: P2, peripheral: DRC, signal: 'drc_dcf, 22', pin_signal: DDR_DCF22}
  - {pin_num: T4, peripheral: DRC, signal: 'drc_dcf, 23', pin_signal: DDR_DCF23}
  - {pin_num: T6, peripheral: DRC, signal: 'drc_dcf, 24', pin_signal: DDR_DCF24}
  - {pin_num: K8, peripheral: DRC, signal: 'drc_dcf, 25', pin_signal: DDR_DCF25}
  - {pin_num: L7, peripheral: DRC, signal: 'drc_dcf, 26', pin_signal: DDR_DCF26}
  - {pin_num: K4, peripheral: DRC, signal: 'drc_dcf, 27', pin_signal: DDR_DCF27}
  - {pin_num: K6, peripheral: DRC, signal: 'drc_dcf, 28', pin_signal: DDR_DCF28}
  - {pin_num: K2, peripheral: DRC, signal: 'drc_dcf, 29', pin_signal: DDR_DCF29}
  - {pin_num: N7, peripheral: DRC, signal: 'drc_dcf, 30', pin_signal: DDR_DCF30}
  - {pin_num: L5, peripheral: DRC, signal: 'drc_dcf, 31', pin_signal: DDR_DCF31}
  - {pin_num: L3, peripheral: DRC, signal: 'drc_dcf, 32', pin_signal: DDR_DCF32}
  - {pin_num: P8, peripheral: DRC, signal: 'drc_dcf, 33', pin_signal: DDR_DCF33}
  - {pin_num: AJ7, peripheral: DRC, signal: 'drc_dm, 0', pin_signal: DDR_DM0}
  - {pin_num: AF4, peripheral: DRC, signal: 'drc_dm, 1', pin_signal: DDR_DM1}
  - {pin_num: D4, peripheral: DRC, signal: 'drc_dm, 2', pin_signal: DDR_DM2}
  - {pin_num: E1, peripheral: DRC, signal: 'drc_dm, 3', pin_signal: DDR_DM3}
  - {pin_num: AP6, peripheral: DRC, signal: 'drc_dm, 4', pin_signal: DDR_DM4}
  - {pin_num: AF6, peripheral: DRC, signal: 'drc_dq, 00', pin_signal: DDR_DQ00}
  - {pin_num: AE5, peripheral: DRC, signal: 'drc_dq, 01', pin_signal: DDR_DQ01}
  - {pin_num: AH8, peripheral: DRC, signal: 'drc_dq, 02', pin_signal: DDR_DQ02}
  - {pin_num: AF8, peripheral: DRC, signal: 'drc_dq, 03', pin_signal: DDR_DQ03}
  - {pin_num: AM4, peripheral: DRC, signal: 'drc_dq, 04', pin_signal: DDR_DQ04}
  - {pin_num: AM6, peripheral: DRC, signal: 'drc_dq, 05', pin_signal: DDR_DQ05}
  - {pin_num: AL5, peripheral: DRC, signal: 'drc_dq, 06', pin_signal: DDR_DQ06}
  - {pin_num: AL7, peripheral: DRC, signal: 'drc_dq, 07', pin_signal: DDR_DQ07}
  - {pin_num: AJ1, peripheral: DRC, signal: 'drc_dq, 08', pin_signal: DDR_DQ08}
  - {pin_num: AJ3, peripheral: DRC, signal: 'drc_dq, 09', pin_signal: DDR_DQ09}
  - {pin_num: AH2, peripheral: DRC, signal: 'drc_dq, 10', pin_signal: DDR_DQ10}
  - {pin_num: AH4, peripheral: DRC, signal: 'drc_dq, 11', pin_signal: DDR_DQ11}
  - {pin_num: AC3, peripheral: DRC, signal: 'drc_dq, 12', pin_signal: DDR_DQ12}
  - {pin_num: AE3, peripheral: DRC, signal: 'drc_dq, 13', pin_signal: DDR_DQ13}
  - {pin_num: AB2, peripheral: DRC, signal: 'drc_dq, 14', pin_signal: DDR_DQ14}
  - {pin_num: AC1, peripheral: DRC, signal: 'drc_dq, 15', pin_signal: DDR_DQ15}
  - {pin_num: E9, peripheral: DRC, signal: 'drc_dq, 17', pin_signal: DDR_DQ17}
  - {pin_num: B6, peripheral: DRC, signal: 'drc_dq, 16', pin_signal: DDR_DQ16}
  - {pin_num: E7, peripheral: DRC, signal: 'drc_dq, 18', pin_signal: DDR_DQ18}
  - {pin_num: D8, peripheral: DRC, signal: 'drc_dq, 19', pin_signal: DDR_DQ19}
  - {pin_num: G7, peripheral: DRC, signal: 'drc_dq, 20', pin_signal: DDR_DQ20}
  - {pin_num: H8, peripheral: DRC, signal: 'drc_dq, 21', pin_signal: DDR_DQ21}
  - {pin_num: G5, peripheral: DRC, signal: 'drc_dq, 23', pin_signal: DDR_DQ23}
  - {pin_num: H6, peripheral: DRC, signal: 'drc_dq, 22', pin_signal: DDR_DQ22}
  - {pin_num: H2, peripheral: DRC, signal: 'drc_dq, 24', pin_signal: DDR_DQ24}
  - {pin_num: H4, peripheral: DRC, signal: 'drc_dq, 25', pin_signal: DDR_DQ25}
  - {pin_num: G3, peripheral: DRC, signal: 'drc_dq, 26', pin_signal: DDR_DQ26}
  - {pin_num: G1, peripheral: DRC, signal: 'drc_dq, 27', pin_signal: DDR_DQ27}
  - {pin_num: A7, peripheral: DRC, signal: 'drc_dq, 28', pin_signal: DDR_DQ28}
